In [ ]:
email guys

In [ ]:
Select statemnet 

Left join

In [ ]:
SQL interview challenges ,
ridge regression with adds

In [ ]:
SELECT name, MAX(salary) as salary FROM employee

In [ ]:
# Write your MySQL query statement below
 SELECT Salary as SecondHighestSalary 
 from employee
 Order by Salary DESC
 LIMIT 1 OFFSET 1;

In [ ]:
# Write your MySQL query statement below
 SELECT IF(Salary = "",null, Salary) as SecondHighestSalary 
 from employee
 Order by Salary DESC
 LIMIT 1 OFFSET 1;

In [ ]:
A subquery may occur in :
- A SELECT clause
- A FROM clause
- A WHERE clause

In [ ]:
Select MAX(salary) as  SecondHighestSalary from employee # runs second 
where salary NOT in (select max(salary) as secondhighestsalary From employee) # runs first
/*
this query will do the where section first then the select section
so it will find the max and select from not the max the second max
*/

In [ ]:
A join A
self join

In [ ]:
Select
...
JOIN Employee b 
ON a, manager id = b.id

In [ ]:
select E1.Name Employee 
from Employee E1 , Employee E2
where E1.ManagerId = E2.Id
and E1.Salary > E2.Salary

In [ ]:
select a.name as Employee
From Employee a
Join Employee b 
On b.Id = a.ManagerId
Where a.salary > b.salary

In [ ]:
self join 
with off

In [ ]:
SELECT DISTINCT SALARY FROM CUSTOMERS
   ORDER BY SALARY;

In [ ]:
# Write your MySQL query statement below
select Distinct (pr1.Email) 
from Person as pr1
join Person as pr2
where pr1.email = pr2.email
and pr1.id != pr2.id

In [ ]:
Select email from person
Group By email
Having Count(email) > 1

In [ ]:
with subqueries
where conditionals 
when CASe

In [ ]:
SELECT DIFF(sales - LAG(sales, 1, 0) OVER (ORDER BY month))

In [ ]:

SELECT temp.Id FROM Weather AS temp, Weather AS ans
WHERE DATEDIFF(temp.RecordDate, ans.RecordDate) = 1 
AND temp.Temperature > ans.Temperature;

In [ ]:
SELECT * FROM employees LIMIT 3;

In [ ]:
SELECT TO_CHAR(TIMESTAMP '2021-01-21 14:40:43', 'Day, Month DD YYYY');

In [ ]:
SELECT TO_CHAR(TIMESTAMP '2021-01-21 14:40:43', 'YYYY-MM-DD HH:MI:SS');

In [ ]:
SELECT TO_CHAR(TIMESTAMP '2021-01-21 14:40:43', 'MM/DD/YY');

In [ ]:
lag() to look as row